프로젝트: 숫자야구 합치기

1. generate_numbers → 무작위로 정답 번호 3개를 뽑는 함수
2. take_guess → 유저에게 번호 3개를 입력받는 함수
3. get_score → 유저 번호 3개와 정답 번호 3개를 비교해서, 스트라이크와 볼 수를 계산하는 함수

이 함수들 활용해 숫자 야구 게임 완성하기 
<게임 진행 예시>
0과 9 사이의 서로 다른 숫자 3개를 랜덤한 순서로 뽑았습니다.

숫자 3개를 하나씩 차례대로 입력하세요.
1번째 숫자를 입력하세요: 2
2번째 숫자를 입력하세요: 2
중복되는 숫자 입니다. 다시 입력하세요.
2번째 숫자를 입력하세요: 11
범위를 벗어나는 숫자입니다. 다시 입력하세요.
2번째 숫자를 입력하세요: 3
3번째 숫자를 입력하세요: 8
1S 1B

숫자 3개를 하나씩 차례대로 입력하세요.
1번째 숫자를 입력하세요: 8
2번째 숫자를 입력하세요: 2
3번째 숫자를 입력하세요: 0
1S 2B

숫자 3개를 하나씩 차례대로 입력하세요.
1번째 숫자를 입력하세요: 2
2번째 숫자를 입력하세요: 8
3번째 숫자를 입력하세요: 0
3S 0B

축하합니다. 3번 만에 숫자 3개의 값과 위치를 모두 맞추셨습니다.

